src/Catalogs/Пользователи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>Пользователи</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Аватар</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛидГруппы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БюджетПУПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БюджетыПУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтслеживатьЗадачиНаРабочемСтоле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Пользователи/Ext/ManagerModule.bsl
Функция НайтиСоздатьПользователя(ДанныеПользователя) Экспорт 
	Если ДанныеПользователя = Неопределено Тогда
		Возврат Справочники.Пользователи.ПустаяСсылка();	
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.Пользователи");
		ЭлементБлокировки.УстановитьЗначение("Наименование", ДанныеПользователя["name"]);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		Блокировка.Заблокировать();
		
		ПользовательСсылка =  Справочники.Пользователи.НайтиПоНаименованию(ДанныеПользователя["name"]);		
		СсылкаАватар = ДанныеПользователя["avatarUrls"]["48x48"];
		Аватар = ВзаимодействиеC_JIRA_Сервер.ВыполнитьGETЗапрос(СсылкаАватар, Истина);
		
		Пользователь = ?(ЗначениеЗаполнено(ПользовательСсылка), ПользовательСсылка.ПолучитьОбъект(), Справочники.Пользователи.СоздатьЭлемент());
		Пользователь.Email = ДанныеПользователя["emailAddress"];
		Пользователь.Наименование = ДанныеПользователя["name"];
		Пользователь.ФИО = ДанныеПользователя["displayName"];
		Пользователь.Аватар = Новый ХранилищеЗначения(Аватар);
		Пользователь.Записать();
		
		ЗафиксироватьТранзакцию();
		
		Возврат Пользователь.Ссылка;
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
КонецФункции

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Не Данные.Свойство("ФИО", Представление);  
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("ФИО");
КонецПроцедуры
